Tekla.Structures.DialogInternal.DialogDataStorageBase
The DialogDataStorageBase class is the base class for data storages of FormBase dialogs.

Tekla.Structures.DialogInternal.DialogDataStorageBase.GetVariable(Tekla.Structures.DialogInternal.AttributeInfo)
Gets the value of the named variable.
info: The AttributeInfo struct that contains the variable information.
Returns: The value of the requested variable.

Tekla.Structures.DialogInternal.DialogDataStorageBase.SetVariable(Tekla.Structures.DialogInternal.AttributeInfo,System.String)
Sets a value for the named variable.
info: The AttributeInfo struct that contains the variable information.
dialogname: The name of the dialog for the variable information.

Tekla.Structures.DialogInternal.DialogDataStorageBase.SetVariableToStack(System.String,System.Object)
Sets values for the variables in the data storage to stack.
name: The name of the variable.
data: The value of the variable.

Tekla.Structures.DialogInternal.DialogDataStorageBase.InitializeLifetimeService
An empty override method required by the System.MarshalByRefObject base class.
Returns: Null always.